<template>
    <my-page title="帮助">
        <ui-article>
            <h2>说明</h2>
            <p>一个简单的原型制作工具。</p>

            <h2>常用操作</h2>
            <ul>
                <li></li>
                <li></li>
                <li></li>
                <li></li>
                <li></li>
            </ul>

            <h3>保存</h3>
            <p>你可以可以通过菜单【文件】->【保存】来保存你的作品。所有的文件数据保存在本地浏览器。</p>
            <p>需要注意的是，保存在浏览器的数据并不是永久保存的，当你进行清除浏览器缓存等操作时，会造成存储的数据丢失。</p>
            <p>为了避免数据的丢失，你可以把作品导出，下次编辑时再导入即可。</p>

            <h3>导入导出</h3>
            <p>你可以通过菜单【文件】->【下载】导出 json 格式的源文件，通过【从文件中导入】按钮导入源文件，继续编辑作品。</p>
            <p>你也可以直接将 json 格式的源文件拖拽到编辑区快速导入。</p>

            <h3>添加链接</h3>
            <p>直接在编辑器拖拽鼠标即可快速添加链接。</p>

            <h3>修改页面图片</h3>
            <p>你可以点击【修改图片】按钮替换页面的图片，也可以通过菜单【插入】->【图片】->【通过网址】来插入网络图片。</p>
            <p>你也可以直接将图片拖拽到网页上来快速修改页面图片。</p>

            <h2>快捷键</h2>
            <p>?：打开帮助页面</p>
        </ui-article>
    </my-page>
</template>
